Hanson227/STM32/[13]/24 I2C/代码/习题/习题4_spi_oled/oled/oled.h
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//中景园电子
//店铺地址：http://shop73023976.taobao.com/?spm=2013.1.0.0.M4PqC2
//
//  文 件 名   : main.c
//  版 本 号   : v2.0
//  作    者   : HuangKai
//  生成日期   : 2014-0101
//  最近修改   : 
//  功能描述   : OLED 4接口演示例程(51系列)
//              说明: 
//              ----------------------------------------------------------------
//              GND    电源地
//              VCC  接5V或3.3v电源
//              D0   接PD6（SCL）
//              D1   接PD7（SDA）
//              RES  接PD4
//              DC   接PD5
//              CS   接PD3               
//              ----------------------------------------------------------------
// 修改历史   :
// 日    期   : 
// 作    者   : HuangKai
// 修改内容   : 创建文件
//版权所有，盗版必究。
//Copyright(C) 中景园电子2014/3/16
//All rights reserved
//******************************************************************************/
#ifndef __OLED_H
#define __OLED_H
#include "delay.h"
#include "sys.h"
#include "stdlib.h"	
#include <stm32f4xx.h>
//OLED模式设置
//0:4线串行模式
//1:并行8080模式
#define OLED_MODE 0
#define SIZE 16
#define XLevelL		0x00
#define XLevelH		0x10
#define Max_Column	128
#define Max_Row		64
#define	Brightness	0xFF 
#define X_WIDTH 	128
#define Y_WIDTH 	64	    						  
//-----------------OLED端口定义----------------  					   
#define OLED_CS_Clr()  GPIO_ResetBits(GPIOC,GPIO_Pin_11)//CS
#define OLED_CS_Set()  GPIO_SetBits(GPIOC,GPIO_Pin_11)

#define OLED_RST_Clr() GPIO_ResetBits(GPIOC,GPIO_Pin_6)//RES
#define OLED_RST_Set() GPIO_SetBits(GPIOC,GPIO_Pin_6)

#define OLED_DC_Clr() GPIO_ResetBits(GPIOC,GPIO_Pin_8)//DC
#define OLED_DC_Set() GPIO_SetBits(GPIOC,GPIO_Pin_8)

#define OLED_SCLK_Clr() PDout(6) = 0//CLK
#define OLED_SCLK_Set() PDout(6) = 1

#define OLED_SDIN_Clr() GPIO_ResetBits(GPIOD,GPIO_Pin_7)//DIN
#define OLED_SDIN_Set() GPIO_SetBits(GPIOD,GPIO_Pin_7)

/*#define OLED_SCLK_Clr() PCout(11)=0//CLK  	PC11
#define OLED_SCLK_Set() PCout(11)=1

#define OLED_SDIN_Clr() GPIO_ResetBits(GPIOC,GPIO_Pin_8)//DIN(D1)	PC8
#define OLED_SDIN_Set() GPIO_SetBits(GPIOC,GPIO_Pin_8)

#define OLED_RST_Clr() GPIO_ResetBits(GPIOC,GPIO_Pin_11)//RES		PC6
#define OLED_RST_Set() GPIO_SetBits(GPIOC,GPIO_Pin_11)

#define OLED_DC_Clr() GPIO_ResetBits(GPIOD,GPIO_Pin_7)//DC			PD7
#define OLED_DC_Set() GPIO_SetBits(GPIOD,GPIO_Pin_7)
 		     
#define OLED_CS_Clr()  GPIO_ResetBits(GPIOD,GPIO_Pin_6)//CS			PD6
#define OLED_CS_Set()  GPIO_SetBits(GPIOD,GPIO_Pin_6)*/


//PC0~7,作为数据线
#define DATAOUT(x) GPIO_Write(GPIOC,x);//输出  
//使用4线串行接口时使用 



 		     
#define OLED_CMD  0	//写命令
#define OLED_DATA 1	//写数据


//OLED控制用函数
void OLED_WR_Byte(u8 dat,u8 cmd);	    
void OLED_Display_On(void);
void OLED_Display_Off(void);	   							   		    
void OLED_Init(void);
void OLED_Clear(void);
void OLED_DrawPoint(u8 x,u8 y,u8 t);
void OLED_Fill(u8 x1,u8 y1,u8 x2,u8 y2,u8 dot);
void OLED_ShowChar(u8 x,u8 y,u8 chr,u8 size);
void OLED_ShowNum(u8 x,u8 y,u32 num,u8 len,u8 size,u8 ssize);
void OLED_ShowString(u8 x,u8 y,u8 *chr,u8 size);	 
void OLED_Set_Pos(unsigned char x, unsigned char y);
void OLED_ShowCHinese(u8 x,u8 y,u8 no);
void OLED_DrawBMP(unsigned char x0, unsigned char y0,unsigned char x1, unsigned char y1,unsigned char BMP[]);
#endif  
	 



